wyniki_10G_article/fio_results_xfs_nvme/block_size_1024/lab-sec-12/fio_seq_write_article_test_output.txt
seq_write_article_test: (g=0): rw=write, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=1
fio-3.36
Starting 1 process
seq_write_article_test: Laying out IO file (1 file / 10240MiB)

seq_write_article_test: (groupid=0, jobs=1): err= 0: pid=63215: Sun Apr 20 16:46:54 2025
  write: IOPS=26.2k, BW=102MiB/s (107MB/s)(18.0GiB/180001msec); 0 zone resets
    slat (usec): min=2, max=34646, avg= 4.19, stdev=16.06
    clat (usec): min=12, max=50326, avg=33.24, stdev=189.01
     lat (usec): min=17, max=50330, avg=37.44, stdev=191.36
    clat percentiles (usec):
     |  1.00th=[   20],  5.00th=[   21], 10.00th=[   23], 20.00th=[   28],
     | 30.00th=[   29], 40.00th=[   30], 50.00th=[   30], 60.00th=[   31],
     | 70.00th=[   31], 80.00th=[   32], 90.00th=[   35], 95.00th=[   36],
     | 99.00th=[   37], 99.50th=[   40], 99.90th=[  519], 99.95th=[ 1762],
     | 99.99th=[10945]
   bw (  KiB/s): min=  351, max=164008, per=100.00%, avg=104816.40, stdev=34309.72, samples=359
   iops        : min=   87, max=41002, avg=26204.07, stdev=8577.55, samples=359
  lat (usec)   : 20=2.22%, 50=97.53%, 100=0.11%, 250=0.01%, 500=0.01%
  lat (usec)   : 750=0.08%, 1000=0.01%
  lat (msec)   : 2=0.02%, 4=0.01%, 10=0.01%, 20=0.03%, 50=0.01%
  lat (msec)   : 100=0.01%
  cpu          : usr=4.50%, sys=14.16%, ctx=4715079, majf=0, minf=12
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,4715062,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=102MiB/s (107MB/s), 102MiB/s-102MiB/s (107MB/s-107MB/s), io=18.0GiB (19.3GB), run=180001-180001msec

Disk stats (read/write):
  nvme0n1: ios=0/4712028, sectors=0/37696140, merge=0/7, ticks=0/128315, in_queue=128348, util=70.36%